---
type: MechanicalSystemType
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 4
tags: [revit-api, class]
---

# MechanicalSystemType

`Autodesk.Revit.DB.Mechanical.MechanicalSystemType` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2012 | `public static MechanicalSystemType Create ( Document ADoc , MEPSystemClassification systemClassification , string name )` |
| Method | ValidateRiseDropSymbolType | 2012 | `public bool ValidateRiseDropSymbolType ( RiseDropSymbol risedropType )` |
| Property | Parameter | — | `` |
| Property | RiseDropSettings | 2012 | `public RiseDropSymbol RiseDropSettings { get ; set ; }` |